[
    {
        "_id": "662d52af4b91b4bcce888a3c",
        "jobName": "Front-end React JS Developer",
        "companyName": "Eptikar IT Solutions",
        "location": "Obour City",
        "minSalary": 5000,
        "maxSalary": 8000,
        "time": "2 hours ago",
        "jobType": "On Site",
        "level": "Intermediate",
        "description": "We are looking for a skilled Front-end React JS Developer to join our team. You will be working on exciting projects in a dynamic and collaborative environment.",
        "tools": ["React JS", "JavaScript", "HTML", "CSS"],
        "aboutUs": "At Eptikar IT Solutions, we foster innovation and embrace collaboration to create tech-driven solutions that inspire change.",
        "jobDescription": "Develop responsive web applications using React.js, collaborate with back-end developers, and ensure the technical feasibility of UI/UX designs.",
        "jobRequirements": "2+ years of experience in front-end development using React.js, proficiency in JavaScript, HTML, and CSS, and experience with RESTful APIs.",
        "favourite": false
    },
    {
        "_id": "662d52af4b91b4bcce888a3d",
        "jobName": "Back-end Node JS Developer",
        "companyName": "Eptikar IT Solutions",
        "location": "Alex City",
        "minSalary": 4000,
        "maxSalary": 8000,
        "time": "2.5 hours ago",
        "jobType": "Full Time",
        "level": "Intermediate",
        "description": "Join us as a Back-end Node JS Developer to build and maintain server-side logic for scalable applications. Collaborate with a passionate team to deliver high-quality products.",
        "tools": ["Node.js", "Express", "MongoDB"],
        "aboutUs": "At Eptikar IT Solutions, we build cutting-edge solutions with a focus on innovation, quality, and customer satisfaction.",
        "jobDescription": "Develop and maintain back-end services and APIs, integrate front-end components with server-side logic, and optimize performance for scalability.",
        "jobRequirements": "2+ years of experience with Node.js and Express, solid understanding of database systems like MongoDB, and experience with RESTful APIs.",
        "favourite": false
    },
    {
        "_id": "662d52af4b91b4bcce888a3e",
        "jobName": "MERN Stack Developer",
        "companyName": "Eptikar IT Solutions",
        "location": "Obour City",
        "minSalary": 10000,
        "maxSalary": 15000,
        "time": "3 hours ago",
        "jobType": "Remote",
        "level": "Expert",
        "description": "We are seeking a seasoned MERN Stack Developer to lead full-stack development projects. You will design and build complex web applications with an emphasis on scalability and performance.",
        "tools": ["React", "Node.js", "MongoDB", "Express"],
        "aboutUs": "At Eptikar IT Solutions, we combine expertise and passion to create transformative digital experiences for our clients.",
        "jobDescription": "Lead the design and development of full-stack applications using the MERN stack, collaborate across teams to implement new features, and ensure high-performance web apps.",
        "jobRequirements": "5+ years of full-stack development experience with MERN stack, deep knowledge of JavaScript, and strong problem-solving skills.",
        "favourite": false
    },
    {
        "_id": "662d52af4b91b4bcce888a3f",
        "jobName": "UI/UX Designer",
        "companyName": "Eptikar IT Solutions",
        "location": "Mansoura City",
        "minSalary": 5000,
        "maxSalary": 10000,
        "time": "3 hours ago",
        "jobType": "Full Time",
        "level": "Entry Level",
        "description": "We are looking for a creative UI/UX Designer to enhance user experiences through visually appealing and intuitive designs.",
        "tools": ["Adobe XD", "Figma", "Sketch"],
        "aboutUs": "At Eptikar IT Solutions, we pride ourselves on creating beautiful, user-centric digital products that solve real problems.",
        "jobDescription": "Design user interfaces and experiences for web and mobile applications, collaborate with developers to ensure seamless integration, and conduct user research to guide design decisions.",
        "jobRequirements": "1+ years of experience in UI/UX design, proficiency in design tools like Figma, Adobe XD, and a strong portfolio of previous design work.",
        "favourite": false
    }
]
